{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 224, 224], "input_dtype": "float32", "sparse": false, "name": "input_5"}, "inbound_nodes": [], "name": "input_5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block1_conv1", "border_mode": "same", "activation": "relu", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": 1.0, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_learning_rate_multiplier": 1.0, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["input_5", 0, 0]]], "name": "block1_conv1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block1_conv2", "border_mode": "same", "activation": "relu", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": 1.0, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_learning_rate_multiplier": 1.0, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block1_conv1", 0, 0]]], "name": "block1_conv2"}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["block1_conv2", 0, 0]]], "name": "block1_pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block2_conv1", "border_mode": "same", "activation": "relu", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": 1.0, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "b_learning_rate_multiplier": 1.0, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block1_pool", 0, 0]]], "name": "block2_conv1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block2_conv2", "border_mode": "same", "activation": "relu", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": 1.0, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "b_learning_rate_multiplier": 1.0, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block2_conv1", 0, 0]]], "name": "block2_conv2"}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["block2_conv2", 0, 0]]], "name": "block2_pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block3_conv1", "border_mode": "same", "activation": "relu", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": 1.0, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "b_learning_rate_multiplier": 1.0, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block2_pool", 0, 0]]], "name": "block3_conv1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block3_conv2", "border_mode": "same", "activation": "relu", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": 1.0, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "b_learning_rate_multiplier": 1.0, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block3_conv1", 0, 0]]], "name": "block3_conv2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block3_conv3", "border_mode": "same", "activation": "relu", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": 1.0, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "b_learning_rate_multiplier": 1.0, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block3_conv2", 0, 0]]], "name": "block3_conv3"}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["block3_conv3", 0, 0]]], "name": "block3_pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block4_conv1", "border_mode": "same", "activation": "relu", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": 1.0, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_learning_rate_multiplier": 1.0, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block3_pool", 0, 0]]], "name": "block4_conv1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block4_conv2", "border_mode": "same", "activation": "relu", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": 1.0, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_learning_rate_multiplier": 1.0, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block4_conv1", 0, 0]]], "name": "block4_conv2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block4_conv3", "border_mode": "same", "activation": "relu", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": 1.0, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_learning_rate_multiplier": 1.0, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block4_conv2", 0, 0]]], "name": "block4_conv3"}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["block4_conv3", 0, 0]]], "name": "block4_pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block5_conv1", "border_mode": "same", "activation": "relu", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": 1.0, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_learning_rate_multiplier": 1.0, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block4_pool", 0, 0]]], "name": "block5_conv1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block5_conv2", "border_mode": "same", "activation": "relu", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": 1.0, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_learning_rate_multiplier": 1.0, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block5_conv1", 0, 0]]], "name": "block5_conv2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block5_conv3", "border_mode": "same", "activation": "relu", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": 1.0, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_learning_rate_multiplier": 1.0, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block5_conv2", 0, 0]]], "name": "block5_conv3"}, {"class_name": "MaxPooling2D", "config": {"name": "block5_pool", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["block5_conv3", 0, 0]]], "name": "block5_pool"}], "input_layers": [["input_5", 0, 0]], "output_layers": [["block5_pool", 0, 0]], "name": "model_9"}}